example_xml/run_report.xml

<?xml version="1.0" encoding="utf-8" ?>
<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
  <env:Body>
    <n1:runReport xmlns:n1="urn:"
        env:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
      <requestXmlString xsi:type="xsd:string">
      <![CDATA[
       <request operationName="runReport" locale="en">
          <argument name="RUN_OUTPUT_FORMAT">HTML</argument>
          <resourceDescriptor name="" wsType=""
              uriString="/reports/Agilence/Loss_by_Month"
              isNew="false">
            <label>null</label>
          </resourceDescriptor>
        </request>
        ]]>
      </requestXmlString>
    </n1:runReport>
  </env:Body>
</env:Envelope>
